import React from "react";

function Privacy() {
  return (
    <div>
      <h1>빠른 상상랩 개인정보처리방침</h1>

      <p>
        빠른 상상랩 (이하 "앱")는 Google Analytics를 사용하여 사용자의 앱 활동을
        분석하고 개선하기 위해 정보를 수집합니다. 이 개인정보처리방침은 사용자가
        앱을 사용할 때 수집되는 정보와 그 사용 방법에 대해 설명합니다.
      </p>

      <h2>1. 수집하는 정보</h2>
      <p>
        앱은 사용자의 활동에 대한 데이터를 수집하기 위해 Google Analytics를
        사용합니다. 수집되는 정보는 다음과 같습니다:
      </p>
      <ul>
        <li>사용자가 앱에서 수행하는 행동(예: 화면 전환, 버튼 클릭)</li>
        <li>세션 시간 및 빈도</li>
        <li>기타 앱 사용 관련 통계 데이터</li>
      </ul>

      <h2>2. 정보의 사용 목적</h2>
      <p>
        수집된 정보는 앱의 성능을 분석하고, 사용자 경험을 개선하며, 오류를
        진단하고 해결하는 데 사용됩니다. 이 정보를 통해 앱은 사용자에게 더 나은
        서비스를 제공할 수 있습니다.
      </p>

      <h2>3. 정보의 보호</h2>
      <p>
        앱은 수집된 데이터를 보호하기 위해 적절한 기술적 및 관리적 보안 조치를
        시행합니다. Google Analytics를 통해 수집된 데이터는 익명화되어 개인을
        식별할 수 없도록 처리됩니다.
      </p>

      <h2>4. 제3자 제공</h2>
      <p>
        앱은 수집된 정보를 제3자와 공유하지 않습니다. 다만, 법적 요구에 따라야
        할 경우, 또는 사용자 동의 하에 정보가 제공될 수 있습니다.
      </p>

      <h2>5. 사용자의 권리 및 선택</h2>
      <p>
        사용자는 앱에서 수집되는 데이터에 대해 선택권을 가집니다. 그러나, 본
        앱은 Google Analytics를 기반으로 최적화되어 있으며, 사용자가 데이터
        수집을 거부할 경우, 앱의 정상적인 사용이 제한될 수 있습니다. 데이터
        수집에 동의하지 않으시는 경우, 본 앱의 사용을 자제해 주시기 바랍니다.
      </p>

      <h2>6. 개인정보처리방침의 변경</h2>
      <p>
        앱은 개인정보처리방침을 수시로 업데이트할 수 있으며, 변경 사항은 앱 내
        또는 웹사이트를 통해 공지됩니다. 사용자는 변경된 개인정보처리방침을
        주기적으로 확인하시기 바랍니다.
      </p>

      <h1>히즈넷 개인정보처리방침</h1>

      <p>
        <a href="https://hisnet.handong.edu">한동대학교 히즈넷</a>의 개인정보
        처리 방침을 참고해주세요.
      </p>
      <p>
        <a href="https://hisnet.handong.edu/registration/agree2.html">
          히즈넷 개인정보처리방침
        </a>
      </p>
    </div>
  );
}

export default Privacy;
